app/controllers/graphs_controller.rb

SELECT * FROM `graph_items` WHERE (`graph_items`.graph_id = 1)
SELECT * FROM `graphs`
---
  def find_resource(id=params[:id])
    returning resource_service.find(id) do |r|
      if r.graph_items.empty?